Revit 2024 API
FamilyInstanceCreationData Constructor (XYZ, FamilySymbol, Element, StructuralType)
Initializes a new instance of the FamilyInstanceCreationData class
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public FamilyInstanceCreationData(
	XYZ location,
	FamilySymbol symbol,
	Element host,
	StructuralType structuralType
)
Visual Basic
Public Sub New ( _
	location As XYZ, _
	symbol As FamilySymbol, _
	host As Element, _
	structuralType As StructuralType _
)
Visual C++
public:
FamilyInstanceCreationData(
	XYZ^ location,
	FamilySymbol^ symbol,
	Element^ host,
	StructuralType structuralType
)
Parameters
location
Type: Autodesk.Revit.DB.XYZ
 The physical location where the instance is to be placed.
symbol
Type: Autodesk.Revit.DB.FamilySymbol
 A FamilySymbol object that represents the type of the instance that is to be inserted.
host
Type: Autodesk.Revit.DB.Element
 The object into which the FamilyInstance is to be inserted, often known as the host.
structuralType
Type: Autodesk.Revit.DB.Structure.StructuralType
 If structural then specify the type of the component.
See Also
FamilyInstanceCreationData Class
FamilyInstanceCreationData Overload
Autodesk.Revit.Creation Namespace